In [42]:
import pandas as pd # für Datenimport
import os # für Dateipfade

In [43]:
customers_file = "data/customers.csv"
customers_path = os.path.join(os.getcwd(), customers_file)
customers_data = pd.read_csv(customers_path)

offers_file = "data/offers.csv"
offers_path = os.path.join(os.getcwd(), offers_file)
offers_data = pd.read_csv(offers_path)

contacts_file = "data/contacts.csv"
contacts_path = os.path.join(os.getcwd(), contacts_file)
contacts_data = pd.read_csv(contacts_path)

In [44]:
customers_data = customers_data.drop(['Unnamed: 0', 'Unnamed: 0.1'], axis=1) # drop-Funktion gibt es ein neues DataFrame aus
customers_data.head()

  gender  age                           cust_id  became_member_on    income
0    NaN  118  68be06ca386d4c31939f3a4f0e3dd783          20170212       NaN
1      F   55  0610b486422d4921ae7d2bf64640c50b          20170715  112000.0
2    NaN  118  38fe809add3b4fcf9315a9694bb96ff5          20180712       NaN
3      F   75  78afa995795e4d85b5d9ceeca43f5fef          20170509  100000.0
4    NaN  118  a03223e636434f42ac4c3df47e8bac43          20170804       NaN

In [45]:
customers_data.columns

Index(['gender', 'age', 'cust_id', 'became_member_on', 'income'], dtype='object')

In [46]:
customers_data[(customers_data["income"].notna() == True)]

,gender,age,cust_id,became_member_on,income
1,F,55,0610b486422d4921ae7d2bf64640c50b,20170715,112000.0
3,F,75,78afa995795e4d85b5d9ceeca43f5fef,20170509,100000.0
5,M,68,e2127556f4f64592b11af22de27a7932,20180426,70000.0
8,M,65,389bc3fa690240e798340f5a15918d5c,20180209,53000.0
12,M,58,2eeac8d8feae4a8cad5a6af0499a211d,20171111,51000.0
...,...,...,...,...,...
16995,F,45,6d5f3a774f3d4714ab0c092238f3a1d7,20180604,54000.0
16996,M,61,2cb4f97358b841b9a9773a7aa05a9d77,20180713,72000.0
16997,M,49,01d26f638c274aa0b965d24cefe3183f,20170126,73000.0
16998,F,83,9dc1421481194dcd9400aec7c9ae6366,20160307,50000.0
16999,F,62,e4052622e5ba45a8b96b59aba68cf068,20170722,82000.0

In [47]:
offers_data

,Unnamed: 0,reward,channels,difficulty,duration,offer_type,id
0,0,10,"['email', 'mobile', 'social']",10,7,bogo,ae264e3637204a6fb9bb56bc8210ddfd
1,1,10,"['web', 'email', 'mobile', 'social']",10,5,bogo,4d5c57ea9a6940dd891ad53e9dbe8da0
2,3,5,"['web', 'email', 'mobile']",5,7,bogo,9b98b8c7a33c4b65b9aebfe6a799e6d9
3,4,5,"['web', 'email']",20,10,discount,0b1e1539f2cc45b7b9fa7c272da2e1d7
4,5,3,"['web', 'email', 'mobile', 'social']",7,7,discount,2298d6c36e964ae4a3e7e9706d1fb8c2
5,6,2,"['web', 'email', 'mobile', 'social']",10,10,discount,fafdcd668e3743c1bb461111dcafc2a4
6,8,5,"['web', 'email', 'mobile', 'social']",5,5,bogo,f19421c1d4aa40978ebb69ca19b0e20d
7,9,2,"['web', 'email', 'mobile']",10,7,discount,2906b810c7d4411798c6938adc9daaa5

In [48]:
contacts_data.head()

,Unnamed,Unnamed: 0,person,event,time,type,val
0,0,0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,offer_id,9b98b8c7a33c4b65b9aebfe6a799e6d9
1,1,1,a03223e636434f42ac4c3df47e8bac43,offer received,0,offer_id,0b1e1539f2cc45b7b9fa7c272da2e1d7
2,2,2,e2127556f4f64592b11af22de27a7932,offer received,0,offer_id,2906b810c7d4411798c6938adc9daaa5
3,3,3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,offer_id,fafdcd668e3743c1bb461111dcafc2a4
4,4,4,68617ca6246f4fbc85e91a2a49552598,offer received,0,offer_id,4d5c57ea9a6940dd891ad53e9dbe8da0

In [49]:
contacts_data.describe()

             Unnamed     Unnamed: 0           time
count  280468.000000  280468.000000  280468.000000
mean   154406.718549  154406.718549     368.652067
std     88660.287132   88660.287132     200.336421
min         0.000000       0.000000       0.000000
25%     78119.750000   78119.750000     192.000000
50%    154005.500000  154005.500000     408.000000
75%    231394.250000  231394.250000     534.000000
max    306533.000000  306533.000000     714.000000

In [50]:
customers_data.became_member_on = pd.to_datetime(customers_data.became_member_on, format='%Y%m%d')
customers_data.became_member_on

0       2017-02-12
1       2017-07-15
2       2018-07-12
3       2017-05-09
4       2017-08-04
           ...
16995   2018-06-04
16996   2018-07-13
16997   2017-01-26
16998   2016-03-07
16999   2017-07-22
Name: became_member_on, Length: 17000, dtype: datetime64[ns]

In [51]:
# Beispiel-Datenframe mit zwei Spalten "Startdatum" und "Enddatum"
df = pd.DataFrame({'Startdatum': ['2021-05-16', '2021-05-17', '2021-05-18'],
                   'Enddatum': ['2021-05-20', '2021-05-19', '2021-05-22']})

# Konvertierung der Spalten in ein Datumsformat
df['Startdatum'] = pd.to_datetime(df['Startdatum'])
df['Enddatum'] = pd.to_datetime(df['Enddatum'])

# Berechnung der Zeitdifferenz zwischen den Datumsangaben
df['Zeitdifferenz'] = df['Enddatum'] - df['Startdatum']

# Ausgabe des aktualisierten Datenframes
print(df)

  Startdatum   Enddatum Zeitdifferenz
0 2021-05-16 2021-05-20        4 days
1 2021-05-17 2021-05-19        2 days
2 2021-05-18 2021-05-22        4 days

In [52]:
import pandas as pd

# Beispiel-Datenframe mit einer Spalte "Datum"
df = pd.DataFrame({'Datum': ['2021-05-16', '2021-05-17', '2021-05-18']})

# Konvertierung der Spalte "Datum" in ein Datumsformat
df['Datum'] = pd.to_datetime(df['Datum'])

# Hinzufügen von 10 Tagen zur Spalte "Datum"
df['Datum_plus_10_Tage'] = df['Datum'] + pd.DateOffset(days=10)

# Ausgabe des aktualisierten Datenframes
print(df)

       Datum Datum_plus_10_Tage
0 2021-05-16         2021-05-26
1 2021-05-17         2021-05-27
2 2021-05-18         2021-05-28

In [53]:
contacts_data["val"][contacts_data["val"].str.contains("d7")].count()

13751

In [57]:
customers_offers = pd.merge(customers_data, contacts_data, left_on="cust_id", right_on="person")

In [59]:
customers_offers.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 280468 entries, 0 to 280467
Data columns (total 10 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   gender            250102 non-null  object
 1   age               280468 non-null  int64
 2   cust_id           280468 non-null  object
 3   became_member_on  280468 non-null  datetime64[ns]
 4   income            250102 non-null  float64
 5   person            280468 non-null  object
 6   event             280468 non-null  object
 7   time              280468 non-null  int64
 8   type              280468 non-null  object
 9   val               280468 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(6)
memory usage: 23.5+ MB

In [55]:
contacts_data = contacts_data.drop(['Unnamed', 'Unnamed: 0'], axis=1)

In [56]:
contacts_data.head()

,person,event,time,type,val
0,78afa995795e4d85b5d9ceeca43f5fef,offer received,0,offer_id,9b98b8c7a33c4b65b9aebfe6a799e6d9
1,a03223e636434f42ac4c3df47e8bac43,offer received,0,offer_id,0b1e1539f2cc45b7b9fa7c272da2e1d7
2,e2127556f4f64592b11af22de27a7932,offer received,0,offer_id,2906b810c7d4411798c6938adc9daaa5
3,8ec6ce2a7e7949b1bf142def7d0e0586,offer received,0,offer_id,fafdcd668e3743c1bb461111dcafc2a4
4,68617ca6246f4fbc85e91a2a49552598,offer received,0,offer_id,4d5c57ea9a6940dd891ad53e9dbe8da0